In [1]:
import pandas as pd
import os
# Files to load using OS.PATH.JOIN()
#school_data_to_load2 = os.path.join("Resrouces", "schools_complete.csv")
#student_data_to_load2 = os.path.join("Resources", "students_complete.csv")

In [2]:
# Files to load
school_data_to_load ="Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [3]:
# Read school data and store in pd.DataFrame
school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

In [4]:
# Get the first rows of the df with .head() and the last rows with .tail()
print(school_data_df.head())
#print(student_data_df.head())
#print(school_data_df.tail())
#print(student_data_df.tail())

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
#Determine if there are missing values with .count()
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [6]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [7]:
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [8]:
school_data_df.notnull().sum()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [9]:
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [10]:
# Data Types with -dtypes of the school df
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [11]:
school_data_df.budget.dtypes

dtype('int64')

In [12]:
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [13]:
# Cleaning the prefixes and suffixes in student_names
# Add prefixes and suffixes to remove from student_names in a list
prefixes_suffixes = ['Dr. ', 'Mr. ', 'Ms. ', 'Mrs. ', 'Miss ', ' MD', ' DDS', ' DVM', ' PhD']
# Iterate through prefixes_suffixes list and replace them with an empty space when it appears in the student's name. 
# Since student_names is an object it must convert it to str in order to use thee replace method available ONLY for strings

for word in prefixes_suffixes:
    student_data_df['student_name'] = student_data_df['student_name'].str.replace(word, '', regex = True)
    
print(student_data_df['student_name'].head(10))

0       Paul Bradley
1       Victor Smith
2    Kevin Rodriguez
3      Richard Scott
4         Bonnie Ray
5      Bryan Miranda
6      Sheena Carter
7       Nicole Baker
8       Michael Roth
9     Matthew Greene
Name: student_name, dtype: object

In [14]:
#Check if the module student df is the same as the one cleaned by me
clean_data_to_load =  "Resources/clean_students_complete.csv"

student_data_clean_df = pd.read_csv(clean_data_to_load)

student_data_df['student_name'].equals(student_data_clean_df['student_name'])

True

In [16]:
# Inner merge of student and school df

school_data_complete_df = pd.merge(student_data_df, school_data_df, on ='school_name')
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [19]:
# Get the total number of sutdents
student_count = school_data_complete_df['Student ID'].count()
student_count

39170

In [23]:
# Calculate the total number of schools
school_count = len(school_data_complete_df['school_name'].unique())
school_count

15

In [24]:
#Calculate the total budget
total_budget = school_data_df['budget'].sum()
total_budget

24649428

In [28]:
# Calculate the average reading and math score
avg_reading_score = school_data_complete_df['reading_score'].mean()
print('Avg Reading Score: ' + str(avg_reading_score))
avg_math_score = school_data_complete_df['math_score'].mean()
print('Avg Math Score: ' + str(avg_math_score))

Avg Reading Score: 81.87784018381414
Avg Math Score: 78.98537145774827

In [30]:
# Determine the passing grade for math and reading
passing_math = school_data_complete_df[school_data_complete_df['math_score'] >= 70]
passing_reading = school_data_complete_df[school_data_complete_df['reading_score'] >= 70]
print(passing_math.head())

   Student ID   student_name gender grade        school_name  reading_score  \
0           0   Paul Bradley      M   9th  Huang High School             66
4           4     Bonnie Ray      F   9th  Huang High School             97
5           5  Bryan Miranda      M   9th  Huang High School             94
6           6  Sheena Carter      F  11th  Huang High School             82
8           8   Michael Roth      M  10th  Huang High School             95

   math_score  School ID      type  size   budget
0          79          0  District  2917  1910635
4          84          0  District  2917  1910635
5          94          0  District  2917  1910635
6          80          0  District  2917  1910635
8          87          0  District  2917  1910635

In [33]:
# Calculate the number of students who passed math and reading
passing_math_count = passing_math['student_name'].count()
passing_reading_count = passing_reading['student_name'].count()
print(passing_math_count, passing_reading_count)

29370 33610

In [34]:
# Calculate the prcnt of passed math and reding
passing_math_prcnt = passing_math_count / float(student_count) * 100
passing_reading_prcnt = passing_reading_count / float(student_count) * 100
print(passing_math_prcnt , passing_reading_prcnt)

74.9808526933878 85.80546336482001

In [39]:
# Calculate the number of sutdents who passed both math and reading
passing_math_reading = school_data_complete_df[(school_data_complete_df['math_score']>= 70) & (school_data_complete_df['reading_score']>=70)]
passing_math_reading.head()

25528

In [44]:
# Calculate the number of students who passed both math and reading
overall_passing_math_reading_count = passing_math_reading.student_name.count()
#Caclulate the prcnt of students who passed both math and reading
overall_passing_prcnt = overall_passing_math_reading_count / student_count * 100
overall_passing_prcnt

65.17232575950983

In [45]:
# Adding a list of values with keys to create teh summary DF
district_summary_df = pd.DataFrame(
            [{'Total Schools' : school_count,
             'Total Students' : student_count,
             'Total Budget' : total_budget,
             'Average Math Score': avg_math_score,
             'Average Reading Score' : avg_reading_score,
             '% Passing Math': passing_math_prcnt,
             '% Passing Reading': passing_reading_prcnt,
             '% Overall Passing': overall_passing_prcnt}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [47]:
# Format 'Total Students' witha comma for the thousands separator
district_summary_df['Total Students'] = district_summary_df['Total Students'].map('{:,}'.format)
district_summary_df['Total Students']

0    39,170
Name: Total Students, dtype: object

In [48]:
# Format 'Total Budget' with thousand separator, a decimal separator and a '$'
district_summary_df['Total Budget'] = district_summary_df['Total Budget'].map("${:,.2f}".format)
district_summary_df['Total Budget']

0    $24,649,428.00
Name: Total Budget, dtype: object

In [50]:
# Format the rest of the columns
district_summary_df['Average Math Score'] = district_summary_df['Average Math Score'].map('{:.1f}'.format)
district_summary_df['Average Reading Score'] = district_summary_df['Average Reading Score'].map('{:.1f}'.format)
district_summary_df['% Passing Math'] = district_summary_df['% Passing Math'].map('{:.0f}'.format)
district_summary_df['% Passing Reading'] = district_summary_df['% Passing Reading'].map('{:.0f}'.format)
district_summary_df['% Overall Passing'] = district_summary_df['% Overall Passing'].map('{:.0f}'.format)

In [51]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65